ChibiOS/ChibiOS/os/hal/ports/STM32/LLD/ADCv3/hal_adc_lld.h
#if STM32_ADC_USE_ADC2 && !defined(STM32_ADC_ADC2_DMA_STREAM)
#error "ADC2 DMA stream not defined"
#endif

#if STM32_ADC_USE_ADC3 && !defined(STM32_ADC_ADC3_DMA_STREAM)
#error "ADC3 DMA stream not defined"
#endif

#if STM32_ADC_USE_ADC4 && !defined(STM32_ADC_ADC4_DMA_STREAM)
#error "ADC4 DMA stream not defined"
#endif

#if STM32_DMA_SUPPORTS_DMAMUX

#else /* !STM32_DMA_SUPPORTS_DMAMUX */

/* Check on the validity of the assigned DMA channels.*/
#if STM32_ADC_USE_ADC1 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC1_DMA_STREAM, STM32_ADC1_DMA_MSK)
#error "invalid DMA stream associated to ADC1"
#endif

#if STM32_ADC_USE_ADC2 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC2_DMA_STREAM, STM32_ADC2_DMA_MSK)
#error "invalid DMA stream associated to ADC2"
#endif

#if STM32_ADC_USE_ADC3 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC3_DMA_STREAM, STM32_ADC3_DMA_MSK)
#error "invalid DMA stream associated to ADC3"
#endif

#if STM32_ADC_USE_ADC4 &&                                                   \
    !STM32_DMA_IS_VALID_ID(STM32_ADC_ADC4_DMA_STREAM, STM32_ADC4_DMA_MSK)
#error "invalid DMA stream associated to ADC4"
#endif

#endif /* !STM32_DMA_SUPPORTS_DMAMUX */

/* ADC clock prescaler checks.*/
#if defined(STM32F3XX)
#endif /* defined(STM32F3XX) */

#if defined(STM32L4XX) || defined(STM32L4XXP)
#if STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV2
#define ADC123_PRESC_VALUE              2
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV4
#define ADC123_PRESC_VALUE              4
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV6
#define ADC123_PRESC_VALUE              6
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV8
#define ADC123_PRESC_VALUE              8
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV10
#define ADC123_PRESC_VALUE              10
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV12
#define ADC123_PRESC_VALUE              12
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV16
#define ADC123_PRESC_VALUE              16
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV32
#define ADC123_PRESC_VALUE              32
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV64
#define ADC123_PRESC_VALUE              64
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV128
#define ADC123_PRESC_VALUE              128
#elif STM32_ADC_ADC123_PRESC == ADC_CCR_PRESC_DIV256
#define ADC123_PRESC_VALUE              256
#error "invalid clock divider selected for STM32_ADC_ADC12_PRESC"
#endif
#endif /* defined(STM32L4XX) || defined(STM32L4XXP) */

#if defined(STM32G4XX)
#if STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV2
#define ADC12_PRESC_VALUE               2
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV4
#define ADC12_PRESC_VALUE               4
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV6
#define ADC12_PRESC_VALUE               6
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV8
#define ADC12_PRESC_VALUE               8
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV10
#define ADC12_PRESC_VALUE               10
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV12
#define ADC12_PRESC_VALUE               12
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV16
#define ADC12_PRESC_VALUE               16
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV32
#define ADC12_PRESC_VALUE               32
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV64
#define ADC12_PRESC_VALUE               64
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV128
#define ADC12_PRESC_VALUE               128
#elif STM32_ADC_ADC12_PRESC == ADC_CCR_PRESC_DIV256
#define ADC12_PRESC_VALUE               256
#error "invalid clock divider selected for STM32_ADC_ADC12_PRESC"
#endif

#if STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV2
#define ADC345_PRESC_VALUE              2
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV4
#define ADC345_PRESC_VALUE              4
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV6
#define ADC345_PRESC_VALUE              6
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV8
#define ADC345_PRESC_VALUE              8
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV10
#define ADC345_PRESC_VALUE              10
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV12
#define ADC345_PRESC_VALUE              12
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV16
#define ADC345_PRESC_VALUE              16
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV32
#define ADC345_PRESC_VALUE              32
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV64
#define ADC345_PRESC_VALUE              64
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV128
#define ADC345_PRESC_VALUE              128
#elif STM32_ADC_ADC345_PRESC == ADC_CCR_PRESC_DIV256
#define ADC345_PRESC_VALUE              256
#error "invalid clock divider selected for STM32_ADC_ADC345_PRESC"
#endif
#endif /* defined(STM32G4XX) */

/* ADC clock source checks.*/
#if defined(STM32F3XX)
#if STM32_ADC_ADC12_CLOCK_MODE == ADC_CCR_CKMODE_ADCCK
#define STM32_ADC12_CLOCK               STM32_ADC12CLK
#elif STM32_ADC_ADC12_CLOCK_MODE == ADC_CCR_CKMODE_AHB_DIV1
#define STM32_ADC12_CLOCK               (STM32_HCLK / 1)
#elif STM32_ADC_ADC12_CLOCK_MODE == ADC_CCR_CKMODE_AHB_DIV2
#define STM32_ADC12_CLOCK               (STM32_HCLK / 2)
#elif STM32_ADC_ADC12_CLOCK_MODE == ADC_CCR_CKMODE_AHB_DIV4
#define STM32_ADC12_CLOCK               (STM32_HCLK / 4)
#else
#error "invalid clock mode selected for STM32_ADC_ADC12_CLOCK_MODE"
#endif

#if STM32_ADC_ADC34_CLOCK_MODE == ADC_CCR_CKMODE_ADCCK
#define STM32_ADC34_CLOCK               STM32_ADC34CLK
#elif STM32_ADC_ADC34_CLOCK_MODE == ADC_CCR_CKMODE_AHB_DIV1
#define STM32_ADC34_CLOCK               (STM32_HCLK / 1)
#elif STM32_ADC_ADC34_CLOCK_MODE == ADC_CCR_CKMODE_AHB_DIV2
#define STM32_ADC34_CLOCK               (STM32_HCLK / 2)
#elif STM32_ADC_ADC34_CLOCK_MODE == ADC_CCR_CKMODE_AHB_DIV4
#define STM32_ADC34_CLOCK               (STM32_HCLK / 4)
#else
#error "invalid clock mode selected for STM32_ADC_ADC34_CLOCK_MODE"
#endif

